tutorials/verificationAndValidation/axisymmetricHemispherical/sim/interPhaseChangeFoam/cavNum03/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $initialNut;

boundaryField
{
    ".*"
    {
        type    zeroGradient;
    }

    "symmYMin|symmZMin"
    {
        type    symmetry;
    }
}

// ************************************************************************* //
